<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>我为什么会手撸一个配置中心--起源篇 - Hexo</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">








    <meta name="description" content="&amp;#x804A;&amp;#x804A;&amp;#x540E;&amp;#x7AEF;&amp;#x7684;&amp;#x5DE5;&amp;#x4F5C;&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;&amp;#x540E;&amp;#x7AEF;&amp;#x72D7;&amp;#x6700;&amp;#x6015;&amp;#x7684;&amp;#x6709;&amp;#x51E0;&amp;#x4EF6;&amp;#x4E8B;&amp;#xFF1A;  &amp;#x9700;&amp;#x6C42;&amp;#x505">
<meta property="og:type" content="article">
<meta property="og:title" content="我为什么会手撸一个配置中心--起源篇">
<meta property="og:url" content="http://example.com/2020/03/19/%E6%88%91%E4%B8%BA%E4%BB%80%E4%B9%88%E4%BC%9A%E9%87%8D%E6%96%B0%E5%86%99%E4%B8%80%E4%B8%AA%E9%85%8D%E7%BD%AE%E4%B8%AD%E5%BF%83-%E8%B5%B7%E6%BA%90%E7%AF%87/index.html">
<meta property="og:site_name" content="Hexo">
<meta property="og:description" content="&amp;#x804A;&amp;#x804A;&amp;#x540E;&amp;#x7AEF;&amp;#x7684;&amp;#x5DE5;&amp;#x4F5C;&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;&amp;#x540E;&amp;#x7AEF;&amp;#x72D7;&amp;#x6700;&amp;#x6015;&amp;#x7684;&amp;#x6709;&amp;#x51E0;&amp;#x4EF6;&amp;#x4E8B;&amp;#xFF1A;  &amp;#x9700;&amp;#x6C42;&amp;#x505">
<meta property="og:locale" content="zh_CN">
<meta property="article:published_time" content="2020-03-19T14:16:13.000Z">
<meta property="article:modified_time" content="2020-12-14T09:51:24.050Z">
<meta property="article:author" content="Xiang Shi">
<meta property="article:tag" content="Java">
<meta property="article:tag" content="Redis">
<meta property="article:tag" content="配置中心">
<meta name="twitter:card" content="summary">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    
<script async src="https://www.googletagmanager.com/gtag/js?id=UA-147240985-1"></script>
<script>
    window.dataLayer = window.dataLayer || [];
    function gtag(){dataLayer.push(arguments);}
    gtag('js', new Date());

    gtag('config', 'UA-147240985-1');
</script>


    


<meta name="generator" content="Hexo 5.2.0"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/archives">Archives</a>
            
            <a class="navbar-item "
               href="/categories">Categories</a>
            
            <a class="navbar-item "
               href="/tags">Tag</a>
            
            <a class="navbar-item "
               href="/about">About</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" target="_blank" rel="noopener" href="https://github.com/nadia-repository">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            我为什么会手撸一个配置中心--起源篇
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <time datetime="2020-03-19T14:16:13.000Z" itemprop="datePublished">3月 19 2020</time>
            
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Technology/">Technology</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            9 分钟 读完 (约 1347 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><h2 id="&#x804A;&#x804A;&#x540E;&#x7AEF;&#x7684;&#x5DE5;&#x4F5C;"><a href="#&#x804A;&#x804A;&#x540E;&#x7AEF;&#x7684;&#x5DE5;&#x4F5C;" class="headerlink" title="&#x804A;&#x804A;&#x540E;&#x7AEF;&#x7684;&#x5DE5;&#x4F5C;"></a>&#x804A;&#x804A;&#x540E;&#x7AEF;&#x7684;&#x5DE5;&#x4F5C;</h2><p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x540E;&#x7AEF;&#x72D7;&#x6700;&#x6015;&#x7684;&#x6709;&#x51E0;&#x4EF6;&#x4E8B;&#xFF1A;</p>
<ol>
<li>&#x9700;&#x6C42;&#x505A;&#x4E5F;&#x505A;&#x4E0D;&#x5B8C;&#x5C31;&#x7F62;&#x8FBD;&#xFF0C;&#x9694;&#x4E09;&#x5DEE;&#x4E94;&#x7684;&#x4E1A;&#x52A1;&#x540C;&#x5B66;&#x8FD8;&#x4F1A;&#x8DD1;&#x6765;&#x8BF4;&#x201C;&#x5927;&#x9505;&#xFF0C;&#x6628;&#x5929;&#x4E0A;&#x67B6;&#x7684;&#x4EA7;&#x54C1;&#x9EBB;&#x70E6;&#x8C03;&#x6574;&#x4E0B;&#x6587;&#x6848;&#x201D;&#x3002;&#x3002;&#x3002;</li>
<li>&#x597D;&#x4E0D;&#x5BB9;&#x6613;&#x505A;&#x5B8C;&#x4E86;&#x9700;&#x6C42;&#x5E76;&#x4E14;&#x71AC;&#x5230;&#x4E86;&#x4E0A;&#x7EBF;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x4EA7;&#x54C1;&#x8FC7;&#x6765;&#x8BF4;&#x201C;&#x8001;&#x5F1F;&#xFF0C;&#x90A3;&#x4E2A;&#x9700;&#x6C42;&#x88AB;&#x76D1;&#x7BA1;&#x90E8;&#x95E8;&#x52D2;&#x4EE4;&#x4E0B;&#x67B6;&#x4E86;&#xFF0C;&#x80FD;&#x628A;&#x90A3;&#x4E2A;&#x529F;&#x80FD;&#x4E0B;&#x4E86;&#x4E0D;&#x201D;&#x3002;&#x3002;&#x3002;</li>
<li>&#x4EE3;&#x7801;&#x6572;&#x7684;&#x5F00;&#x5FC3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9694;&#x58C1;&#x8001;&#x5927;&#x8DD1;&#x8FC7;&#x6765;&#x8BF4;&#x201C;&#x5144;&#x5F1F;&#xFF0C;&#x4E4B;&#x524D;&#x90A3;&#x4E2A;XX&#x62A5;&#x8868;&#x4E0D;&#x9519;&#x554A;&#xFF0C;&#x4E5F;&#x5B9A;&#x65F6;&#x53D1;&#x6211;&#x4E00;&#x4EFD;&#x201D;&#x3002;&#x3002;&#x3002;<a id="more"></a>
&#x4E0A;&#x9762;&#x7684;&#x573A;&#x666F;&#x5927;&#x5BB6;&#x8BA4;&#x8BC6;&#x6211;&#x7684;&#x4E0D;&#x8981;&#x5BF9;&#x53F7;&#x5165;&#x5EA7;&#x54C8;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E2A;&#x540E;&#x7AEF;&#x72D7;&#xFF0C;&#x6700;&#x6015;&#x7684;&#x5C31;&#x662F;&#x91CD;&#x590D;&#x52B3;&#x52A8;&#x3002;</li>
</ol>
<p>&#x4EA7;&#x54C1;&#x7684;&#x6587;&#x6848;&#x3001;&#x4E1A;&#x52A1;&#x7684;&#x5F00;&#x5173;&#x3001;&#x62A5;&#x8868;&#x7684;&#x6536;&#x4EF6;&#x4EBA;&#x7B49;&#x7B49;&#x8FD9;&#x4E9B;&#x6211;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x53EB;&#x505A;&#x4E1A;&#x52A1;&#x914D;&#x7F6E;&#xFF0C;&#x4E00;&#x4E2A;&#x5408;&#x683C;&#x7684;&#x5F00;&#x53D1;&#x4E5F;&#x80FD;&#x5728;&#x9700;&#x6C42;&#x8BBE;&#x8BA1;&#x9636;&#x6BB5;&#x5C06;&#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#x4ECE;&#x9700;&#x6C42;&#x4E2D;&#x63D0;&#x70BC;&#x51FA;&#x6765;&#x5E76;&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#x5316;&#xFF0C;&#x65B9;&#x4FBF;&#x65E5;&#x540E;&#x7684;&#x53D8;&#x66F4;&#x3002;<br>&#x90A3;&#x4E48;&#xFF0C;&#x4E0D;&#x662F;&#x8BF4;&#x914D;&#x7F6E;&#x80FD;&#x53D8;&#x66F4;&#x6211;&#x4EEC;&#x5C31;&#x6CA1;&#x4E8B;&#x4E86;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x5982;&#x679C;&#x57FA;&#x4E8E;spring&#x5F00;&#x53D1;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x80AF;&#x5B9A;&#x4F1A;&#x60F3;&#x5230;spring&#x81EA;&#x5E26;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;<br>&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x9694;&#x79BB;&#xFF0C;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x80FD;&#x591F;&#x9694;&#x79BB;&#x51FA;dev&#x3001;staging&#x3001;prod&#x751A;&#x81F3;&#x66F4;&#x591A;&#x73AF;&#x5883;&#x7684;&#x914D;&#x7F6E;&#x3002;&#x6BCF;&#x5F53;&#x914D;&#x7F6E;&#x6709;&#x53D8;&#x66F4;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x76F8;&#x5E94;&#x73AF;&#x5883;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x5E76;&#x91CD;&#x65B0;&#x90E8;&#x7F72;&#x5C31;OK&#x4E86;&#x3002;</p>
<p><font color="red">&#x8FD9;&#x6837;&#x597D;&#x5417;&#xFF1F;</font>&#x7B54;&#x6848;&#x662F;&#x6CA1;&#x4EC0;&#x4E48;&#x4E0D;&#x597D;&#x3002;<font color="red">&#x4F46;&#x662F;&#x4F18;&#x96C5;&#x5417;&#xFF1F;</font>&#x90A3;&#x5FC5;&#x987B;&#x662F;&#x632B;&#x7684;&#x4E00;&#x584C;&#x7CCA;&#x6D82;&#x3002;<br>&#x4E92;&#x8054;&#x7F51;&#x7684;&#x6839;&#x57FA;&#x5C31;&#x662F;&#x5FEB;&#x901F;&#x5C1D;&#x8BD5;&#x3001;&#x5FEB;&#x901F;&#x843D;&#x5730;&#x3001;&#x53CD;&#x590D;&#x5C1D;&#x8BD5;&#x4ECE;&#x800C;&#x5BFB;&#x627E;&#x5230;&#x6700;&#x4F18;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;<br>&#x4E1A;&#x52A1;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x5C1D;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6216;&#x8BB8;&#x4F1A;&#x8E66;&#x51FA;&#x4E2A;&#x5927;&#x795E;&#x62CD;&#x7740;&#x8111;&#x888B;&#x8BF4;&#x201C;&#x6211;&#x89C9;&#x5F97;&#x5BA2;&#x6237;&#x8981;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#xFF0C;&#x8FD9;&#x4E48;&#x90A3;&#x4E48;&#x505A;&#x51C6;&#x6CA1;&#x9519;&#x201D;&#x3002;&#x4F46;&#x73B0;&#x5B9E;&#x5F80;&#x5F80;&#x8BC1;&#x660E;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x6210;&#x4E3A;&#x522B;&#x4EBA;&#x809A;&#x5B50;&#x91CC;&#x7684;&#x86D4;&#x866B;&#x90A3;&#x662F;&#x591A;&#x4E48;&#x56F0;&#x96BE;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;<br>&#x6240;&#x4EE5;&#x9700;&#x6C42;&#x7684;&#x53CD;&#x53CD;&#x590D;&#x590D;&#xFF0C;&#x4EE3;&#x7801;&#x7684;&#x6765;&#x6765;&#x56DE;&#x56DE;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x540E;&#x7AEF;&#x72D7;&#x7684;&#x65E5;&#x5E38;&#x3002;</p>
<h2 id="&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x7684;&#x51FA;&#x73B0;"><a href="#&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x7684;&#x51FA;&#x73B0;" class="headerlink" title="&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x7684;&#x51FA;&#x73B0;"></a>&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x7684;&#x51FA;&#x73B0;</h2><p>&#x90A3;&#x5728;&#x8FD9;&#x79CD;&#x5FEB;&#x901F;&#x53D8;&#x5316;&#x7684;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x4F5C;&#x4E3A;&#x5F00;&#x53D1;&#x80FD;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x7B54;&#xFF0C;&#x53E4;&#x4EBA;&#x90FD;&#x8BF4;&#x4E86;&#x201C;&#x5927;&#x9053;&#x5316;&#x7B80;&#x201D;&#xFF0C;&#x90A3;&#x81EA;&#x7136;&#x662F;&#x6709;&#x53D8;&#x5316;&#x6211;&#x4EEC;&#x5C31;&#x62E5;&#x62B1;&#x53D8;&#x5316;&#x3002;<br>&#x4F46;&#x4E00;&#x4E2A;&#x806A;&#x660E;&#x6216;&#x8005;&#x8BF4;&#x61D2;&#x60F0;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x62E5;&#x62B1;&#x53D8;&#x5316;&#x7684;&#x540C;&#x65F6;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x5BFB;&#x627E;&#x90A3;&#x4E2A;&#x4E0D;&#x53D8;&#x3002;&#x4EE3;&#x7801;&#x7684;&#x62BD;&#x8C61;&#x3001;&#x4E1A;&#x52A1;&#x7684;&#x62BD;&#x8C61;&#x65F6;&#x6211;&#x4EEC;&#x65E5;&#x540E;&#x670D;&#x52A1;&#x642D;&#x5EFA;&#x7684;&#x6839;&#x57FA;&#x3002;&#x81EA;&#x7136;&#x6211;&#x4EEC;&#x4E0A;&#x9762;&#x8BF4;&#x9053;&#x7684;&#x914D;&#x7F6E;&#x5F53;&#x7136;&#x4E5F;&#x662F;&#x3002;</p>
<p>&#x806A;&#x660E;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x65E9;&#x5C31;&#x628A;&#x8FD9;&#x4E9B;&#x7E41;&#x6742;&#x7684;&#x5DE5;&#x4F5C;&#x62BD;&#x79BB;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x800C;&#x7136;&#x800C;&#x7136;&#x7684;&#x5B55;&#x80B2;&#x51FA;&#x4E16;&#x3002;&#x767E;&#x5EA6;&#x7684;Disconf&#x3001;&#x643A;&#x7A0B;&#x7684;Apollo&#x3001;&#x963F;&#x91CC;&#x7684;Nacos&#x3001;Spring Cloud&#x7684;Spring Cloud Config&#x3002;<br>&#x540E;&#x9762;&#x6211;&#x4F1A;&#x4E13;&#x95E8;&#x804A;&#x804A;&#x8FD9;&#x51E0;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x7684;&#x4F18;&#x52A3;&#x3002;</p>
<h2 id="&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x624B;&#x64B8;&#x4E2A;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;"><a href="#&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x624B;&#x64B8;&#x4E2A;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;" class="headerlink" title="&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x624B;&#x64B8;&#x4E2A;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;"></a>&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x624B;&#x64B8;&#x4E2A;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;</h2><p>&#x90A3;&#x8FD8;&#x8981;&#x56DE;&#x5230;1&#x5E74;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x516C;&#x53F8;&#x6700;&#x4E3A;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#xFF0C;&#x4E1A;&#x52A1;&#x521A;&#x521A;&#x8D77;&#x6B65;&#x3002;&#x4E3A;&#x4E86;&#x5FEB;&#x901F;&#x7684;&#x4E1A;&#x52A1;&#x843D;&#x5730;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x662F;&#x80FD;&#x6765;&#x4EC0;&#x4E48;&#x5C31;&#x6765;&#x4EC0;&#x4E48;&#xFF0C;&#x65F6;&#x95F4;&#x957F;&#x4E86;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#xFF1A;<font color="red">&#x53D1;&#x7248;&#x6210;&#x5206;&#x592A;&#x9AD8;</font>&#x3002;</p>
<p>&#x76F8;&#x4FE1;&#x6BCF;&#x4E2A;&#x505A;&#x5F00;&#x53D1;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x90FD;&#x6709;&#x4F53;&#x4F1A;&#xFF0C;&#x665A;&#x4E0A;&#x53D1;&#x7248;&#x662F;&#x4E00;&#x4EF6;&#x591A;&#x4E48;&#x8BA9;&#x4EBA;&#x60C6;&#x6005;&#x7684;&#x4E8B;&#x60C5;&#x554A;&#x3002;&#x3002;&#x3002;&#x4F46;&#x66F4;&#x8BA9;&#x4EBA;&#x60C6;&#x6005;&#x7684;&#x662F;&#xFF0C;&#x672C;&#x6765;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#xFF0C;&#x5374;&#x8FD8;&#x8981;&#x7B49;&#x5230;&#x665A;&#x4E0A;&#x624D;&#x80FD;&#x91CD;&#x65B0;&#x4E0A;&#x7EBF;&#xFF0C;&#x7740;&#x5B9E;&#x8BA9;&#x4EBA;&#x53D7;&#x4E0D;&#x4E86;&#x3002;&#x4ECE;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6253;&#x7B97;&#x5F15;&#x5165;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x4E86;&#x3002;</p>
<p>&#x9996;&#x5148;&#x8C03;&#x7814;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x7ECF;&#x8FC7;&#x51E0;&#x4E2A;&#x73B0;&#x5B58;&#x5F00;&#x6E90;&#x7CFB;&#x7EDF;&#x7684;&#x6BD4;&#x8F83;&#xFF0C;&#x6700;&#x540E;&#x9009;&#x5B9A;&#x4E86;&#x767E;&#x5EA6;&#x7684;Disconf&#x3002;&#x8BF4;&#x4E0A;&#x5C31;&#x4E0A;&#xFF0C;Disconf&#x5C31;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x6109;&#x5FEB;&#x7684;&#x5954;&#x8DD1;&#x8D77;&#x6765;&#x4E86;&#x3002;</p>
<p>1&#x5E74;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x7CFB;&#x7EDF;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x4E1A;&#x52A1;&#x8D8A;&#x6765;&#x8D8A;&#x7E41;&#x7410;&#xFF0C;&#x5F53;&#x521D;&#x90A3;&#x4E2A;&#x4EBA;&#x89C1;&#x4EBA;&#x7231;&#x7684;Disconf&#x4E0D;&#x65F6;&#x7684;&#x53D8;&#x6210;&#x4E86;&#x6211;&#x4EEC;&#x5348;&#x996D;&#x65F6;&#x8BDF;&#x75C5;&#x7684;&#x8C08;&#x8D44;&#x3002;&#x5F53;&#x7136;&#x5E76;&#x4E0D;&#x662F;Disconf&#x672C;&#x8EAB;&#x4E0D;&#x597D;&#xFF0C;&#x4E0D;&#x8FC7;&#x5931;&#x53BB;&#x7EF4;&#x62A4;&#x7684;&#x793E;&#x533A;&#x672C;&#x8EAB;&#x4E5F;&#x662F;&#x5B83;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x73AF;&#x3002;&#x4F46;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;Disconf&#x672C;&#x8EAB;&#x5DF2;&#x7ECF;&#x6162;&#x6162;&#x4E0D;&#x9002;&#x5408;&#x6211;&#x4EEC;&#x7684;&#x4E1A;&#x52A1;&#x4E86;&#x3002;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E9B;&#x5C0F;&#x4F19;&#x4F34;&#x8BF4;&#xFF0C;&#x90A3;&#x5C31;&#x4F7F;&#x7528;&#x66F4;&#x5F3A;&#x5927;&#x7684;Apollo&#xFF0C;&#x6216;&#x8005;Nacos&#x3002;Apollo&#x672C;&#x8EAB;&#x56FA;&#x7136;&#x5F3A;&#x5927;&#xFF0C;&#x4F46;&#x4E00;&#x4E2A;&#x7B2C;&#x4E09;&#x65B9;&#x7CFB;&#x7EDF;&#x59CB;&#x7EC8;&#x65E0;&#x6CD5;&#x5951;&#x5408;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x7684;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#xFF0C;Nacos&#x4E5F;&#x6709;&#x540C;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x624D;&#x5916;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F;Spring Cloud&#x7684;&#x5168;&#x5BB6;&#x6876;&#xFF0C;&#x82E5;&#x5F15;&#x5165;Nacos&#xFF0C;&#x5FC5;&#x7136;&#x9700;&#x8981;&#x5347;&#x7EA7;&#x5230;Alibaba Spring Cloud&#x3002;&#x60F3;&#x5FC5;&#x98CE;&#x9669;&#x548C;&#x5DE5;&#x4F5C;&#x91CF;&#x53EA;&#x589E;&#x65E0;&#x51CF;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x5927;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5192;&#x51FA;&#x4E86;&#x201C;&#x6211;&#x4EC0;&#x4E48;&#x4E0D;&#x81EA;&#x5DF1;&#x624B;&#x64B8;&#x4E2A;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x201D;&#x7684;&#x60F3;&#x6CD5;&#x3002;</p>
<h2 id="&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;-nadia-config"><a href="#&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;-nadia-config" class="headerlink" title="&#x914D;&#x7F6E;&#x4E2D;&#x5FC3; nadia-config"></a>&#x914D;&#x7F6E;&#x4E2D;&#x5FC3; nadia-config</h2><p>&#x81EA;&#x6211;&#x6253;&#x4E2A;&#x5E7F;&#x544A;&#xFF0C;&#x6211;&#x7684;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x5DF2;&#x7ECF;&#x4E0A;&#x7EBF;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x7B2C;&#x4E00;&#x7248;&#x4E5F;&#x5DF2;&#x7ECF;&#x5F00;&#x6E90;&#xFF0C;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x62CD;&#x7816; </p>
<blockquote>
<p><a target="_blank" rel="noopener" href="https://github.com/nadia-repository/nadia-config">https://github.com/nadia-repository/nadia-config</a></p>
</blockquote>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Java/">#Java</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Redis/">#Redis</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/%E9%85%8D%E7%BD%AE%E4%B8%AD%E5%BF%83/">#配置中心</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/2020/03/20/%E6%88%91%E4%B8%BA%E4%BB%80%E4%B9%88%E4%BC%9A%E9%87%8D%E6%96%B0%E5%86%99%E4%B8%80%E4%B8%AA%E9%85%8D%E7%BD%AE%E4%B8%AD%E5%BF%83-%E4%BB%8B%E7%BB%8D%E7%AF%87/">我为什么会手撸一个配置中心--介绍篇</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2020/03/01/%E5%88%86%E5%B8%83%E5%BC%8F%E4%B8%80%E8%87%B4%E6%80%A7%E7%AE%97%E6%B3%95%E6%95%B4%E7%90%86/">分布式一致性算法整理</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="addthis_inline_share_toolbox"></div>
<script type="text/javascript" src="//s7.addthis.com/js/300/addthis_widget.js#pubid=ra-5d71c42eb9261743"></script>

</div>



<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'http://example.com/2020/03/19/%E6%88%91%E4%B8%BA%E4%BB%80%E4%B9%88%E4%BC%9A%E9%87%8D%E6%96%B0%E5%86%99%E4%B8%80%E4%B8%AA%E9%85%8D%E7%BD%AE%E4%B8%AD%E5%BF%83-%E8%B5%B7%E6%BA%90%E7%AF%87/';
        this.page.identifier = '2020/03/19/我为什么会重新写一个配置中心-起源篇/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'xzenge' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a target="_blank" rel="noopener" href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 Xiang Shi&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        target="_blank" rel="noopener" href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" target="_blank" rel="noopener" href="https://github.com/nadia-repository">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" target="_blank" rel="noopener" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>